Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG01/atdf/PIC32CK2051SG01100.atdf
      <value-group name="CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="ETH" id="03792" name2="eth_gem_apb_v1" version="1b0" caption="Ethernet Controller">
      <register-group name="SA" size="0x8">
        <register name="SAB" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Specific Address Bottom [31:0] Register">
          <bitfield name="ADDR" caption="Specific Address 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="SAT" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Specific Address Top [47:32] Register">
          <bitfield name="ADDR" caption="Specific Address 1" mask="0xFFFF"/>
        </register>
      </register-group>
      <register-group name="ETH" caption="Ethernet Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="CTRLA Register">
          <bitfield name="SWRST" caption="Software Reset Bit" mask="0x1"/>
          <bitfield name="ENABLE" caption="Macro Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in standby mode" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x000000C0" caption="CTRLB Register">
          <bitfield name="GMIIEN" caption="Select GMII/MII mode" mask="0x1"/>
          <bitfield name="GBITCLKREQ" caption="Gigabit clock request" mask="0x2"/>
          <bitfield name="TSUCLKREQ" caption="TSU Clock Request" mask="0x4"/>
          <bitfield name="TSUMS" caption="Timer Adjust" mask="0x20"/>
          <bitfield name="TSUINC" caption="Timer Adjust Mode" mask="0xC0"/>
        </register>
        <register name="EVCTRL" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Event Control Register">
          <bitfield name="CMPEO" caption="Compare Event Out enable" mask="0x1"/>
        </register>
        <register name="SYNCB" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Sync Busy Register">
          <bitfield name="SWRST" caption="Software Reset Sync Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Sync Busy" mask="0x2"/>
        </register>
        <register name="NCR" offset="0x1000" rw="RW" size="4" initval="0x00000000" caption="Network Control Register">
          <bitfield name="LBL" caption="Loop Back Local" mask="0x2"/>
          <bitfield name="RXEN" caption="Receive Enable" mask="0x4"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x8"/>
          <bitfield name="MPE" caption="Management Port Enable" mask="0x10"/>
          <bitfield name="CLRSTAT" caption="Clear Statistics Registers" mask="0x20"/>
          <bitfield name="INCSTAT" caption="Increment Statistics Registers" mask="0x40"/>
          <bitfield name="WESTAT" caption="Write Enable for Statistics Registers" mask="0x80"/>
          <bitfield name="BP" caption="Back pressure" mask="0x100"/>
          <bitfield name="TSTART" caption="Start Transmission" mask="0x200"/>
          <bitfield name="THALT" caption="Transmit Halt" mask="0x400"/>
          <bitfield name="TXPF" caption="Transmit Pause Frame" mask="0x800"/>
          <bitfield name="TXZQPF" caption="Transmit Zero Quantum Pause Frame" mask="0x1000"/>
          <bitfield name="SRTSM" caption="Store Receive Time Stamp to Memory" mask="0x8000"/>
          <bitfield name="ENPBPR" caption="Enable PFC Priority-based Pause Reception" mask="0x10000"/>
          <bitfield name="TXPBPF" caption="Transmit PFC Priority-based Pause Frame" mask="0x20000"/>
          <bitfield name="FNP" caption="Flush Next Packet" mask="0x40000"/>
          <bitfield name="LPI" caption="Low Power Idle Enable" mask="0x80000"/>
        </register>
        <register name="NCFGR" offset="0x1004" rw="RW" size="4" initval="0x00080000" caption="Network Configuration Register">
          <bitfield name="SPD" caption="Speed" mask="0x1"/>
          <bitfield name="FD" caption="Full Duplex" mask="0x2"/>
          <bitfield name="DNVLAN" caption="Discard Non-VLAN FRAMES" mask="0x4"/>
          <bitfield name="JFRAME" caption="Jumbo Frame Size" mask="0x8"/>
          <bitfield name="CAF" caption="Copy All Frames" mask="0x10"/>
          <bitfield name="NBC" caption="No Broadcast" mask="0x20"/>
          <bitfield name="MTIHEN" caption="Multicast Hash Enable" mask="0x40"/>
          <bitfield name="UNIHEN" caption="Unicast Hash Enable" mask="0x80"/>
          <bitfield name="MAXFS" caption="1536 Maximum Frame Size" mask="0x100"/>
          <bitfield name="GIGE" caption="Gigabit mode Enable" mask="0x400"/>
          <bitfield name="RTY" caption="Retry Test" mask="0x1000"/>
          <bitfield name="PEN" caption="Pause Enable" mask="0x2000"/>
          <bitfield name="RXBUFO" caption="Receive Buffer Offset" mask="0xC000"/>
          <bitfield name="LFERD" caption="Length Field Error Frame Discard" mask="0x10000"/>
          <bitfield name="RFCS" caption="Remove FCS" mask="0x20000"/>
          <bitfield name="CLK" caption="MDC CLock Division" mask="0x1C0000"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x600000"/>
          <bitfield name="DCPF" caption="Disable Copy of Pause Frames" mask="0x800000"/>
          <bitfield name="RXCOEN" caption="Receive Checksum Offload Enable" mask="0x1000000"/>
          <bitfield name="EFRHD" caption="Enable Frames Received in Half Duplex" mask="0x2000000"/>
          <bitfield name="IRXFCS" caption="Ignore RX FCS" mask="0x4000000"/>
          <bitfield name="IPGSEN" caption="IP Stretch Enable" mask="0x10000000"/>
          <bitfield name="RXBP" caption="Receive Bad Preamble" mask="0x20000000"/>
          <bitfield name="IRXER" caption="Ignore IPG GRXER" mask="0x40000000"/>
        </register>
        <register name="NSR" offset="0x1008" rw="R" size="4" initval="0x00000004" caption="Network Status Register">
          <bitfield name="MDIO" caption="MDIO Input Status" mask="0x2"/>
          <bitfield name="IDLE" caption="PHY Management Logic Idle" mask="0x4"/>
        </register>
        <register name="UR" offset="0x100C" rw="RW" size="4" initval="0x00000000" caption="User Register">
          <bitfield name="UO" caption="User Programmable Outputs" mask="0xFFFF"/>
          <bitfield name="UI" caption="User Programmable Inputs" mask="0xFFFF0000"/>
        </register>
        <register name="DCFGR" offset="0x1010" rw="RW" size="4" initval="0x00020704" caption="DMA Configuration Register">
          <bitfield name="FBLDO" caption="Fixed Burst Length for DMA Data Operations:" mask="0x1F"/>
          <bitfield name="ESMA" caption="Endian Swap Mode Enable for Management Descriptor Accesses" mask="0x40"/>
          <bitfield name="ESPA" caption="Endian Swap Mode Enable for Packet Data Accesses" mask="0x80"/>
          <bitfield name="RXBMS" caption="Receiver Packet Buffer Memory Size Select" mask="0x300"/>
          <bitfield name="TXPBMS" caption="Transmitter Packet Buffer Memory Size Select" mask="0x400"/>
          <bitfield name="TXCOEN" caption="Transmitter Checksum Generation Offload Enable" mask="0x800"/>
          <bitfield name="DRBS" caption="DMA Receive Buffer Size" mask="0xFF0000"/>
          <bitfield name="DDRP" caption="DMA Discard Receive Packets" mask="0x1000000"/>
        </register>
        <register name="TSR" offset="0x1014" rw="RW" size="4" initval="0x00000000" caption="Transmit Status Register">
          <bitfield name="UBR" caption="Used Bit Read" mask="0x1"/>
          <bitfield name="COL" caption="Collision Occurred" mask="0x2"/>
          <bitfield name="RLE" caption="Retry Limit Exceeded" mask="0x4"/>
          <bitfield name="TXGO" caption="Transmit Go" mask="0x8"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x10"/>
          <bitfield name="TXCOMP" caption="Transmit Complete" mask="0x20"/>
          <bitfield name="UND" caption="Transmit Underrun" mask="0x40"/>
          <bitfield name="LCOL" caption="Late Colision Occured" mask="0x80"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x100"/>
        </register>
