Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG01/atdf/PIC32CK2051SG01100.atdf
        <register modes="I2CS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CS Control B">
          <bitfield name="SMEN" caption="Smart Mode Enable" mask="0x100"/>
          <bitfield name="GCMD" caption="PMBus Group Command" mask="0x200"/>
          <bitfield name="AACKEN" caption="Automatic Address Acknowledge" mask="0x400"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_I2CS_CTRLB__AMODE"/>
          <bitfield name="CMD" caption="Command" mask="0x30000"/>
          <bitfield name="ACKACT" caption="Acknowledge Action" mask="0x40000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_I2CS_CTRLB__FIFOCLR"/>
        </register>
        <register modes="SPIM" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIM Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200" values="SERCOM_SPIM_CTRLB__SSDE"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000" values="SERCOM_SPIM_CTRLB__MSSEN"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_SPIM_CTRLB__FIFOCLR"/>
        </register>
        <register modes="SPIS" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPIS Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_SPIM_CTRLB__CHSIZE"/>
          <bitfield name="PLOADEN" caption="Data Preload Enable" mask="0x40"/>
          <bitfield name="SSDE" caption="Slave Select Low Detect Enable" mask="0x200"/>
          <bitfield name="MSSEN" caption="Master Slave Select Enable" mask="0x2000"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPIM_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="SERCOM_SPIM_CTRLB__FIFOCLR"/>
        </register>
        <register modes="USART_INT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="FIFOCLR" caption="FIFO Clear" mask="0xC00000" values="USART_CTRLB__FIFOCLR"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="USART_CTRLB__LINCMD"/>
        </register>
        <register modes="I2CM" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CM Control C">
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_I2CM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_I2CM_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="I2CS" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="I2CS Control C">
          <bitfield name="SDASETUP" caption="SDA Setup Time" mask="0xF"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_I2CS_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_I2CS_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="SPIM" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPIM Control C">
          <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
          <bitfield name="FSES" caption="Frame Synch Edge Select" mask="0x100"/>
          <bitfield name="FSLEN" caption="Frame Synch Length" mask="0x200" values="SERCOM_SPIM_CTRLC__FSLEN"/>
          <bitfield name="FSPOL" caption="Frame Synch Polarity" mask="0x400" values="SERCOM_SPIM_CTRLC__FSPOL"/>
          <bitfield name="IGNTUR" caption="Ignore Transmit Underrun" mask="0x800"/>
          <bitfield name="FRMEN" caption="Frame mode enable" mask="0x10000"/>
          <bitfield name="FMODE" caption="Frame mode" mask="0x20000" values="SERCOM_SPIM_CTRLC__FMODE"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_SPIM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_SPIM_CTRLC__TXTRHOLD"/>
        </register>
        <register modes="SPIS" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SPIS Control C">
          <bitfield name="ICSPACE" caption="Inter-Character Spacing" mask="0x3F"/>
          <bitfield name="FSES" caption="Frame Synch Edge Select" mask="0x100"/>
          <bitfield name="FSLEN" caption="Frame Synch Length" mask="0x200" values="SERCOM_SPIM_CTRLC__FSLEN"/>
          <bitfield name="FSPOL" caption="Frame Synch Polarity" mask="0x400" values="SERCOM_SPIM_CTRLC__FSPOL"/>
          <bitfield name="IGNTUR" caption="Ignore Transmit Underrun" mask="0x800"/>
          <bitfield name="FRMEN" caption="Frame mode enable" mask="0x10000"/>
          <bitfield name="FMODE" caption="Frame mode" mask="0x20000" values="SERCOM_SPIM_CTRLC__FMODE"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x1000000"/>
          <bitfield name="FIFOEN" caption="FIFO Enable" mask="0x8000000"/>
          <bitfield name="RXTRHOLD" caption="Receive FIFO Threshold" mask="0x30000000" values="SERCOM_SPIM_CTRLC__RXTRHOLD"/>
          <bitfield name="TXTRHOLD" caption="Transmit FIFO Threshold" mask="0xC0000000" values="SERCOM_SPIM_CTRLC__TXTRHOLD"/>
        </register>
